# DX 602 Week 9 Homework

## Introduction

In this homework, you will continue practicing use of the pandas library for more sophisticated analysis.

## Example Code

You may find it helpful to refer to this GitHub repository of Jupyter notebooks for example code.

* https://github.com/bu-cds-omds/dx602-examples

Any calculations demonstrated in code examples or videos may be found in these notebooks, and you are allowed to copy this example code in your homework answers.

## Shared Imports

Do not install or use any additional modules.
Installing additional modules may result in an autograder failure resulting in zero points for some or all problems.

In [1]:
import math
import sys

In [2]:
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd

## Shared Data

In [3]:
abalone = pd.read_csv("abalone.tsv", sep="\t")
abalone.head()

,Sex,Length,Diameter,Height,Whole_weight,Shucked_weight,Viscera_weight,Shell_weight,Rings
0,M,0.455,0.365,0.095,0.5140,0.2245,0.1010,0.150,15
1,M,0.350,0.265,0.090,0.2255,0.0995,0.0485,0.070,7
2,F,0.530,0.420,0.135,0.6770,0.2565,0.1415,0.210,9
3,M,0.440,0.365,0.125,0.5160,0.2155,0.1140,0.155,10
4,I,0.330,0.255,0.080,0.2050,0.0895,0.0395,0.055,7

In [4]:
penguins_adelie = pd.read_csv("https://raw.githubusercontent.com/bu-cds-omds/dx602-examples/refs/heads/main/data/palmer-penguins-adelie.csv", index_col="Sample Number")
penguins_gentoo = pd.read_csv("https://raw.githubusercontent.com/bu-cds-omds/dx602-examples/refs/heads/main/data/palmer-penguins-gentoo.csv", index_col="Sample Number")
penguins_chinstrap = pd.read_csv("https://raw.githubusercontent.com/bu-cds-omds/dx602-examples/refs/heads/main/data/palmer-penguins-chinstrap.csv", index_col="Sample Number")
penguins = pd.concat([penguins_adelie, penguins_gentoo, penguins_chinstrap])
penguins.head()

,studyName,Species,Region,Island,Stage,Individual ID,Clutch Completion,Date Egg,Culmen Length (mm),Culmen Depth (mm),Flipper Length (mm),Body Mass (g),Sex,Delta 15 N (o/oo),Delta 13 C (o/oo),Comments
Sample Number,,,,,,,,,,,,,,,,
1,PAL0708,Adelie Penguin (Pygoscelis adeliae),Anvers,Torgersen,"Adult, 1 Egg Stage",N1A1,Yes,2007-11-11,39.1,18.7,181.0,3750.0,MALE,NaN,NaN,Not enough blood for isotopes.
2,PAL0708,Adelie Penguin (Pygoscelis adeliae),Anvers,Torgersen,"Adult, 1 Egg Stage",N1A2,Yes,2007-11-11,39.5,17.4,186.0,3800.0,FEMALE,8.94956,-24.69454,NaN
3,PAL0708,Adelie Penguin (Pygoscelis adeliae),Anvers,Torgersen,"Adult, 1 Egg Stage",N2A1,Yes,2007-11-16,40.3,18.0,195.0,3250.0,FEMALE,8.36821,-25.33302,NaN
4,PAL0708,Adelie Penguin (Pygoscelis adeliae),Anvers,Torgersen,"Adult, 1 Egg Stage",N2A2,Yes,2007-11-16,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Adult not sampled.
5,PAL0708,Adelie Penguin (Pygoscelis adeliae),Anvers,Torgersen,"Adult, 1 Egg Stage",N3A1,Yes,2007-11-16,36.7,19.3,193.0,3450.0,FEMALE,8.76651,-25.32426,NaN

## Problems

### Problem 1

Set `p1` to be a data frame of penguin data from the Palmer Penguins data set grouped by species, region, and island, with the average measurements.

In [5]:
# YOUR CHANGES HERE

p1 = penguins.groupby(['Species', 'Region', 'Island'], as_index=False).mean(numeric_only=True)

In [6]:
p1

,Species,Region,Island,Culmen Length (mm),Culmen Depth (mm),Flipper Length (mm),Body Mass (g),Delta 15 N (o/oo),Delta 13 C (o/oo)
0,Adelie Penguin (Pygoscelis adeliae),Anvers,Biscoe,38.975000,18.370455,188.795455,3709.659091,8.823593,-25.918702
1,Adelie Penguin (Pygoscelis adeliae),Anvers,Dream,38.501786,18.251786,189.732143,3688.392857,8.948276,-25.747446
2,Adelie Penguin (Pygoscelis adeliae),Anvers,Torgersen,38.950980,18.429412,191.196078,3706.372549,8.792753,-25.757806
3,Chinstrap penguin (Pygoscelis antarctica),Anvers,Dream,48.833824,18.420588,195.823529,3733.088235,9.356155,-24.546542
4,Gentoo penguin (Pygoscelis papua),Anvers,Biscoe,47.504878,14.982114,217.186992,5076.016260,8.245338,-26.185298

### Problem 2

Set `p2` to be a data frame or series of the unique islands in the penguins data set.

Hint: while this can be done with the groupby method, there are more direct ways that you have seen to do this.

In [7]:
# YOUR CHANGES HERE

p2 = penguins["Island"].drop_duplicates()

In [8]:
p2

Sample Number
1     Torgersen
21       Biscoe
31        Dream
Name: Island, dtype: object

### Problem 3

Set `p3` to a query string filtering a data frame of abalone data to just the rows where the number of rings is 10 or fewer and the abalone is female.
This query string should be suitable to use with the data frame `query` method.

In [9]:
# YOUR CHANGES HERE

p3 = 'Sex == "F" and Rings <= 10'

In [10]:
# show query results if p3 was set

abalone.query(p3) if p3 is not ... else None

,Sex,Length,Diameter,Height,Whole_weight,Shucked_weight,Viscera_weight,Shell_weight,Rings
2,F,0.530,0.420,0.135,0.6770,0.2565,0.1415,0.2100,9
13,F,0.535,0.405,0.145,0.6845,0.2725,0.1710,0.2050,10
14,F,0.470,0.355,0.100,0.4755,0.1675,0.0805,0.1850,10
17,F,0.440,0.340,0.100,0.4510,0.1880,0.0870,0.1300,10
23,F,0.550,0.415,0.135,0.7635,0.3180,0.2100,0.2000,9
...,...,...,...,...,...,...,...,...,...
4139,F,0.635,0.495,0.175,1.2355,0.5205,0.3085,0.3470,10
4140,F,0.645,0.535,0.190,1.2395,0.4680,0.2385,0.4240,10
4159,F,0.560,0.440,0.135,0.8025,0.3500,0.1615,0.2590,9
4168,F,0.515,0.400,0.125,0.6150,0.2865,0.1230,0.1765,8
4175,F,0.625,0.485,0.150,1.0945,0.5310,0.2610,0.2960,10

### Problem 4

The variable `p4` has a some data about fruits with some missing ratings.
The variable `q4` has some data updates to fill in the missing ratings.
Use `q4` to fill in the missing data in `p4`.

Hint: you just want to *update* the data, not replace the entire column.

In [11]:
# DO NOT CHANGE

p4 = pd.DataFrame(
    data={"color": ["red", "green", "brown", "yellow", "orange", "green"],
          "rating": [None, None, None, 5, 4, 3]},
    index=['apple', 'grape', 'kiwi', 'mango', 'papaya', 'pear'])
p4

         color  rating
apple      red     NaN
grape    green     NaN
kiwi     brown     NaN
mango   yellow     5.0
papaya  orange     4.0
pear     green     3.0

In [12]:
# DO NOT CHANGE

q4 = pd.DataFrame(data={"rating":[3, 2, 3]},
                  index=["kiwi", "apple", "grape"])
q4

       rating
kiwi        3
apple       2
grape       3

In [16]:
# YOUR CHANGES HERE

q4 = pd.DataFrame(
    data={"rating": [3, 2, 3]},
    index=["kiwi", "apple", "grape"]
)

In [17]:
# this should show no more rows with missing data
p4

         color  rating
apple      red     NaN
grape    green     NaN
kiwi     brown     NaN
mango   yellow     5.0
papaya  orange     4.0
pear     green     3.0

### Problem 5

Join the data frame in `q5` with the data in `u5` matching the `hw1_submission` column in `q5` to the index of `u5` and assign the result to `p5`.

In [18]:
# DO NOT CHANGE

q5 = pd.DataFrame(data={"student_id": ["U100", "U101", "U102", "U103", "U104"],
                        "hw1_submission": ["c1325", "b231", "a512", "e9999", "d8234"]})
q5

  student_id hw1_submission
0       U100          c1325
1       U101           b231
2       U102           a512
3       U103          e9999
4       U104          d8234

In [19]:
# DO NOT CHANGE

u5 = pd.DataFrame(index=["a512", "b231", "c1325", "d8234", "e9999"],
                  data={"hw1_grade": [0.99, 0.50, 0.62, 0.78, 1.00]} )
u5

       hw1_grade
a512        0.99
b231        0.50
c1325       0.62
d8234       0.78
e9999       1.00

In [20]:
# YOUR CHANGES HERE

p5 = q5.join(u5, on="hw1_submission")

In [21]:
p5

  student_id hw1_submission  hw1_grade
0       U100          c1325       0.62
1       U101           b231       0.50
2       U102           a512       0.99
3       U103          e9999       1.00
4       U104          d8234       0.78

### Problem 6

Set `p6` to be the number of penguins in the Palmer Penguins data set with body mass at least 5 kilograms.

Hint: think of this problem as having two steps. First, filter the data set based on the criteria. Then, count the matching rows.

In [23]:
# YOUR CHANGES HERE
heavy_penguins = penguins[penguins["Body Mass (g)"] >= 5000]
p6 = heavy_penguins.shape[0]

In [24]:
p6

67

### Problem 7

Reproduce the garden bed cost analysis using the files "design_materials_7.tsv" and "material_costs_7".tsv.
Set `p7` to be a data frame with a new "cost" column for the cost of each design.

In [35]:
print(design_materials.columns)

Index(['design', 'material', 'quantity_per_bed'], dtype='object')

In [36]:
# YOUR CHANGES HERE
design_materials = pd.read_csv("design_materials_7.tsv", sep="\t")
material_costs_7 = pd.read_csv("material_costs_7.tsv", sep="\t")
merged = design_materials.merge(material_costs_7, on="material")
merged["item_cost"] = merged["quantity_per_bed"] * merged["unit_cost"]
p7 = merged.groupby("design", as_index=False)["item_cost"].sum()
p7 = p7.rename(columns={"item_cost": "cost"})

In [37]:
# this should use the design names from "design_materials_7.tsv" as the index,
# and have one cost column.

p7

          design    cost
0  4' x 4' x 12"  137.08
1  4' x 4' x 18"  160.76
2  4' x 8' x 12"  188.00
3  4' x 8' x 18"  226.92

### Problem 8

Read the code assigning to `q8` below.
Set `p8` to be a string suitable to pass `penguins.query` to get a data frame matching `q8`.

In [38]:
# DO NOT CHANGE

q8 = penguins[(penguins["Sex"] == "MALE") & (penguins["Region"] == "Anvers")]

In [39]:
# YOUR CHANGES HERE

p8 = 'Sex == "MALE" and Region == "Anvers"'

In [40]:
# the compare method returns rows where the two data frames are different.
# if your query string is correct, the comparison should return zero rows with differences.
q8.compare(penguins.query(p8)) if p8 is not ... else None

Empty DataFrame
Columns: []
Index: []

### Problem 9

Set `p9` to be a data frame or series where the index is species from the penguins data set, and there is one column counting the number of penguins of each species.
There should only be one row per species in the data frame.

Hint: what kind of operations would change the penguins data to have an index like this?

In [41]:
# YOUR CHANGES HERE

p9 = penguins.groupby("Species").size().to_frame(name="count")

In [42]:
# this data frame should have 3 rows, one for each species.

p9

                                           count
Species
Adelie Penguin (Pygoscelis adeliae)          152
Chinstrap penguin (Pygoscelis antarctica)     68
Gentoo penguin (Pygoscelis papua)            124

### Problem 10

Set `p10` to the result of joining the data frame in `q10` with the data in `u10` matching the column `b` in `q10` to the index of `u10`.
If there is no matching data in `u10`, the data from `q10` should still be in `p10`.

Hint: what is the hard part of this join?

In [43]:
# DO NOT CHANGE

q10 = pd.DataFrame(data={"a": [1, 3, 6, 2, 8, 10],
                         "b": [9, 3, 5, 7, 10, 8]})
q10

    a   b
0   1   9
1   3   3
2   6   5
3   2   7
4   8  10
5  10   8

In [44]:
# DO NOT CHANGE

u10 = pd.DataFrame(data={"b": [1, 2, 3, 4, 5, 6, 7],
                         "c": [111, 222, 333, 444, 555, 666, 777]})
u10 = u10.set_index("b")
u10

     c
b
1  111
2  222
3  333
4  444
5  555
6  666
7  777

In [45]:
# YOUR CHANGES HERE

p10 = q10.merge(u10, how="left", left_on="b", right_index=True)

In [46]:
p10

    a   b      c
0   1   9    NaN
1   3   3  333.0
2   6   5  555.0
3   2   7  777.0
4   8  10    NaN
5  10   8    NaN

In [47]:
# these row counts should be the same.
(len(p10), len(q10)) if p10 is not ... else None

(6, 6)

### Problem 11

Set p11 to be the name of the penguin species in the Palmer Penguins data set with the longest average female bill length. You may have to research how to interpret the column names.

Hint: there are three operations here - averaging bill length by the species, filtering to females, and picking the species with the longest average bill length.
The order that you do these operations may affect how you perform them.

In [50]:
# YOUR CHANGES HERE
female_penguins = penguins[penguins["Sex"] == "FEMALE"]
avg_culmen_length = female_penguins.groupby("Species")["Culmen Length (mm)"].mean()
p11 = avg_culmen_length.idxmax()

In [51]:
# what could you print earlier to spot check this answer?
p11

'Chinstrap penguin (Pygoscelis antarctica)'

### Problem 12

Using the Palmer Penguins data set, set `p12` to be the species with the most samples with body mass below 2.9 kilograms.

In [52]:
# YOUR CHANGES HERE
light_penguins = penguins[penguins["Body Mass (g)"] < 2900]
counts = light_penguins["Species"].value_counts()
p12 = counts.idxmax()

In [53]:
# what stats could you use to check this answer?

p12

'Adelie Penguin (Pygoscelis adeliae)'

### Problem 13

Set `p13` to be a pandas Series with a row for each penguin appearing multiple times in the data set where the series value is the number of rows for that penguin.

Hint: start with counting the number of rows for each individual penguin, and then filter the list.

In [54]:
# YOUR CHANGES HERE
individual_counts = penguins["Individual ID"].value_counts()
p13 = individual_counts[individual_counts > 1]

In [55]:
# confirm that each row corresponds to an individual penguin,
# and the row counts are more than one.
p13

Individual ID
N6A1     3
N6A2     3
N13A2    3
N13A1    3
N8A2     3
        ..
N85A2    2
N15A1    2
N15A2    2
N14A2    2
N14A1    2
Name: count, Length: 114, dtype: int64

### Problem 14

Set `p14` to be a copy of `q14` reorganized with recipe rows and ingredient columns and summing the cups column for the values in `p14`.
Any values not covered by `q14` should default to zero in `p14`.

Hint: use a function from https://pandas.pydata.org/docs/user_guide/reshaping.html

In [56]:
# DO NOT CHANGE

q14 = pd.DataFrame(data={"recipe": ["cake", "cake", "cake", "cake", "candy", "candy"],
                         "ingredient": ["flour", "water", "sugar", "butter", "sugar", "water"],
                         "cups": [2, 0.5, 1, 0.25, 2, 1]})
q14

  recipe ingredient  cups
0   cake      flour  2.00
1   cake      water  0.50
2   cake      sugar  1.00
3   cake     butter  0.25
4  candy      sugar  2.00
5  candy      water  1.00

In [57]:
# YOUR CHANGES HERE

p14 = q14.pivot_table(index="recipe",
                      columns="ingredient",
                      values="cups",
                      aggfunc="sum",
                      fill_value=0)

`p14` should have structure like this, but the specific row and column orders do not matter.

| | butter | flour | sugar | water |
|---|---|---|---|---|
| cake | | | | |
| candy | | | | |

In [58]:
p14

ingredient  butter  flour  sugar  water
recipe
cake          0.25    2.0    1.0    0.5
candy         0.00    0.0    2.0    1.0

### Problem 15

Write a function `p15` that takes in three filenames as input; a file name of device orders, a file name for device components, and a file name of component costs; and returns the total cost.

* The orders file contains two columns -- `device` and `device_quantity`.
* The components file contains three columns -- `device`, `component`, and `component_quantity`.
* The costs file contains two columns -- `component` and `component_cost`.

In [69]:
def p15(orders_filename, components_filename, costs_filename):
    orders = pd.read_csv(orders_filename, sep=None, engine='python')
    components = pd.read_csv(components_filename, sep=None, engine='python')
    costs = pd.read_csv(costs_filename, sep=None, engine='python')
    orders.columns = orders.columns.str.strip()
    components.columns = components.columns.str.strip()
    costs.columns = costs.columns.str.strip()
    components_with_cost = components.merge(costs, on="component")
    components_with_cost["total_component_cost"] = (
    components_with_cost["component_quantity"] * components_with_cost["component_cost"])
    merged = components_with_cost.merge(orders, on="device")
    merged["line_cost"] = merged["device_quantity"] * merged["total_component_cost"]
    total_cost = merged["line_cost"].sum()
    return total_cost

In [70]:
# this should return 767.59
p15("orders_15.tsv", "components_15.tsv", "costs_15.tsv")

np.float64(767.59)

### Problem 16

Write a function `p16` that takes in a list of filenames, reads all of them, and returns all of their rows in a single data frame in the same order as the input files and the order they were specified.
You may assume that all of the files have TSV format and the same columns.

Hint: you've seen a simpler version of this behavior loading penguin data.

In [71]:
# YOUR CHANGES HERE

def p16(filenames):
    dfs = []
    for file in filenames:
        df = pd.read_csv(file, sep="\t")
        dfs.append(df)
    
    combined_df = pd.concat(dfs, ignore_index=True)
    
    return combined_df

In [72]:
# the resulting data frame should have one column alpha and values 1-9 in order.
p16(["f16a.tsv", "f16b.tsv", "f16c.tsv"])

   alpha
0      1
1      2
2      3
3      4
4      5
5      6
6      7
7      8
8      9

### Problem 17

Write a function `p17` that takes in a filename, loads the file, appends a new column "source" containing the name of the file, and returns the resulting data frame.
You may assume that the file has TSV format.

In [73]:
# YOUR CHANGES HERE

def p17(filename):
    df = pd.read_csv(filename, sep="\t")
    df["source"] = filename
    return df

In [74]:
p17("f17a.tsv")

   beta    source
0     2  f17a.tsv
1     4  f17a.tsv
2     8  f17a.tsv

### Problem 18

Write a function `p18` that takes in three filenames, and joins them together one a time starting from the first file.
The first column of the second and third files should be used to join to the previous result.
If there is missing data in the joined files, then the available data should be kept and N/A values should be used for the columns of the later files.

That is, the data in the first file should be joined to the second file using the first column of the second file.
Then that joined data should be joined again to the third file using the first column of the third file.
Return the data frame from the final join.

In [76]:
# YOUR CHANGES HERE

def p18(file_1_name, file_2_name, file_3_name):
    df1 = pd.read_csv(file_1_name, sep="\t")
    df2 = pd.read_csv(file_2_name, sep="\t")
    df3 = pd.read_csv(file_3_name, sep="\t")
    
    key2 = df2.columns[0]
    merged_1_2 = df1.merge(df2, left_on=df1.columns[0], right_on=key2, how="left")
    
    key3 = df3.columns[0]
    final_merged = merged_1_2.merge(df3, left_on=merged_1_2.columns[0], right_on=key3, how="left")
    
    return final_merged

In [77]:
# reuse p15 test data - should have no missing data
p18("orders_15.tsv", "components_15.tsv", "costs_15.tsv")

,device,device_quantity,component_x,component_quantity,component_y,component_cost
0,gizmo,2,sprocket,7,NaN,NaN
1,gizmo,2,oilcan,2,NaN,NaN
2,gadget,3,gear,13,NaN,NaN
3,gadget,3,spring,17,NaN,NaN
4,widget,5,sprocket,11,NaN,NaN
5,widget,5,spring,4,NaN,NaN
6,widget,5,bolt,5,NaN,NaN
7,widget,5,sandpaper,3,NaN,NaN

### Problem 19

Set `p19` to be the a data frame with one row containing the penguin species and sex with the longest average bill length.
The column names of should be "Species", "Sex", and the name of the bill length column.

Hint: the groupby method of data frames has an option controlling whether the grouped columns become the index or stay as normal columns. After you have grouped the data, consider your options to sort the data, and then think about how to take the longest (max) value.

In [78]:
# YOUR CHANGES HERE
avg_bill = penguins.groupby(["Species", "Sex"], as_index=False)["Culmen Length (mm)"].mean()
p19 = avg_bill.sort_values("Culmen Length (mm)", ascending=False).head(1)

In [79]:
# this should just have one row.
# is there an intermediate result that you could print earlier to spot check this answer?

p19

                                     Species   Sex  Culmen Length (mm)
3  Chinstrap penguin (Pygoscelis antarctica)  MALE           51.094118

### Problem 20

Write a function `p20` that takes in a filename for components of a single device, a list of filenames where each file has a different set of device costs, and returns a data frame of costs by filename.
The output should have two columns, "filename" and "cost".

Hint: you have already done similar analysis for multiple devices and designs. The main difference here is that the cost data is spread out across multiple files, and you need to report analysis results per file. How should you load the cost data while keeping it associated to the right files?

In [80]:
# YOUR CHANGES HERE

def p20(components_filename, cost_filenames):
    components = pd.read_csv(components_filename)
    results = []

    for fname in cost_filenames:
        costs = pd.read_csv(fname)
        merged = components.merge(costs, on="component")
        merged["total_component_cost"] = merged["component_quantity"] * merged["component_cost"]
        total_cost = merged["total_component_cost"].sum()
        results.append({"filename": fname, "cost": total_cost})

    return pd.DataFrame(results)

In [81]:
# this should return a data frame with one row with cost 21.00

p20("robot_cat_20.tsv", ["supplier_a_20.tsv"])

KeyError: 'component'

In [ ]:
# this should return a data frame with two rows.
# the cost for supplier_a_20 should be 21.00.
# the cost for supplier_b_20 should be 34.50.

p20("robot_cat_20.tsv", ["supplier_a_20.tsv", "supplier_b_20.tsv"])